Documents/ДополнительныеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДополнительныеРасходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДополнительныеРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДополнительныеРасходы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализировать данные документа.
// 
// Параметры:
//  ДокументДополнительныеРасходы - ДокументСсылка.ДополнительныеРасходы - Ссылка на документ "ДополнительныеРасходы"
//  СтруктураДополнительныеСвойства - Структура - дополнительные свойства
Процедура ИнициализироватьДанныеДокумента(ДокументДополнительныеРасходы, ДополнительныеСвойства) Экспорт  
	
	ТаблицаДополнительныеРасходы = ДанныеТаблицаДополнительныеРасходы(ДокументДополнительныеРасходы, ДополнительныеСвойства);
		
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРасходы", ТаблицаДополнительныеРасходы);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеТаблицаДополнительныеРасходы(ДокументДополнительныеРасходы, СтруктураДополнительныеСвойства)  
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументДополнительныеРасходы.Ссылка КАК Ссылка,
	               |	ДокументДополнительныеРасходы.Дата КАК Период,
	               |	ДокументДополнительныеРасходы.ТипРасходов КАК ТипРасходов,
	               |	ДокументДополнительныеРасходы.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ДополнительныеРасходы КАК ДокументДополнительныеРасходы
	               |ГДЕ
	               |	ДокументДополнительныеРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументДополнительныеРасходы);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
